test/artillery/report.express.txt
Engine           -> Express
Mode             -> production
Max log level    -> ERROR

All VUs finished. Total time: 4 minutes, 17 seconds

--------------------------------
Summary report @ 16:23:08(+0300)
--------------------------------

errors.ETIMEDOUT: .................... 4046
http.codes.200: ...................... 20570
http.codes.201: ...................... 4928
http.codes.204: ...................... 3678
http.codes.404: ...................... 3678
http.codes.409: ...................... 562
http.request_rate: ................... 146/sec
http.requests: ....................... 37462
http.response_time:
  min: ............................... 0
  max: ............................... 9996
  median: ............................ 7
  p95: ............................... 8520.7
  p99: ............................... 9607.1
http.responses: ...................... 33416
vusers.completed: .................... 3678
vusers.created: ...................... 8286
vusers.created_by_name.CRUD cycle: ... 8286
vusers.failed: ....................... 4608
vusers.session_length:
  min: ............................... 3153.1
  max: ............................... 23808.1
  median: ............................ 5826.9
  p95: ............................... 20958.1
  p99: ............................... 22703.7