test/artillery/report.fastify.txt
Engine           -> Fastify
Mode             -> production
Max log level    -> ERROR

All VUs finished. Total time: 4 minutes, 19 seconds

--------------------------------
Summary report @ 16:32:23(+0300)
--------------------------------

errors.ETIMEDOUT: .................... 4326
http.codes.200: ...................... 19272
http.codes.201: ...................... 4518
http.codes.204: ...................... 3266
http.codes.404: ...................... 3275
http.codes.409: ...................... 491
http.request_rate: ................... 139/sec
http.requests: ....................... 35360
http.response_time:
  min: ............................... 0
  max: ............................... 9999
  median: ............................ 7
  p95: ............................... 8520.7
  p99: ............................... 9801.2
http.responses: ...................... 30822
vusers.completed: .................... 3275
vusers.created: ...................... 8303
vusers.created_by_name.CRUD cycle: ... 8303
vusers.failed: ....................... 4817
vusers.session_length:
  min: ............................... 3148.8
  max: ............................... 23354
  median: ............................ 4492.8
  p95: ............................... 21813.5
  p99: ............................... 22703.7